StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_debug.c
#ifdef CONFIG_PCI_HCI
#endif

	RTW_PRINT_SEL(sel, "CONFIG_IFACE_NUMBER = %d\n", CONFIG_IFACE_NUMBER);
#ifdef CONFIG_MI_WITH_MBSSID_CAM
	RTW_PRINT_SEL(sel, "CONFIG_MI_WITH_MBSSID_CAM\n");
#endif
#ifdef CONFIG_SWTIMER_BASED_TXBCN
	RTW_PRINT_SEL(sel, "CONFIG_SWTIMER_BASED_TXBCN\n");
#endif
#ifdef CONFIG_FW_HANDLE_TXBCN
	RTW_PRINT_SEL(sel, "CONFIG_FW_HANDLE_TXBCN\n");
	RTW_PRINT_SEL(sel, "CONFIG_LIMITED_AP_NUM = %d\n", CONFIG_LIMITED_AP_NUM);
#endif
#ifdef CONFIG_CLIENT_PORT_CFG
	RTW_PRINT_SEL(sel, "CONFIG_CLIENT_PORT_CFG\n");
#endif
#ifdef CONFIG_AXI_TX_POLLING
	RTW_PRINT_SEL(sel, "CONFIG_AXI_TX_POLLING\n");
#endif
	RTW_PRINT_SEL(sel, "CONFIG_RTW_UP_MAPPING_RULE = %s\n", (CONFIG_RTW_UP_MAPPING_RULE == 1) ? "dscp" : "tos");

	RTW_PRINT_SEL(sel, "\n=== XMIT-INFO ===\n");
	RTW_PRINT_SEL(sel, "NR_XMITFRAME = %d\n", NR_XMITFRAME);
	RTW_PRINT_SEL(sel, "NR_XMITBUFF = %d\n", NR_XMITBUFF);
	RTW_PRINT_SEL(sel, "MAX_XMITBUF_SZ = %d\n", MAX_XMITBUF_SZ);
	RTW_PRINT_SEL(sel, "NR_XMIT_EXTBUFF = %d\n", NR_XMIT_EXTBUFF);
	RTW_PRINT_SEL(sel, "MAX_XMIT_EXTBUF_SZ = %d\n", MAX_XMIT_EXTBUF_SZ);
	RTW_PRINT_SEL(sel, "MAX_CMDBUF_SZ = %d\n", MAX_CMDBUF_SZ);

	RTW_PRINT_SEL(sel, "\n=== RECV-INFO ===\n");
	RTW_PRINT_SEL(sel, "NR_RECVFRAME = %d\n", NR_RECVFRAME);
	RTW_PRINT_SEL(sel, "NR_RECVBUFF = %d, rtw_recvbuf_nr = %d\n", NR_RECVBUFF, rtw_recvbuf_nr);
	RTW_PRINT_SEL(sel, "MAX_RECVBUF_SZ = %d\n", MAX_RECVBUF_SZ);

}
#endif /*	CONFIG_PROC_DEBUG	*/


void dump_log_level(void *sel)
{
#ifdef CONFIG_RTW_DEBUG
	int i;

	RTW_PRINT_SEL(sel, "drv_log_level:%d\n", rtw_drv_log_level);
	for (i = 0; i <= _DRV_MAX_; i++) {
		if (rtw_log_level_str[i])
			RTW_PRINT_SEL(sel, "%c %s = %d\n",
				      (rtw_drv_log_level == i) ? '+' : ' ', rtw_log_level_str[i], i);
	}
#else
	RTW_PRINT_SEL(sel, "CONFIG_RTW_DEBUG is disabled\n");
#endif
}

#ifdef CONFIG_SDIO_HCI
void sd_f0_reg_dump(void *sel, _adapter *adapter)
{
	int i;

	for (i = 0x0; i <= 0xff; i++) {
		if (i % 16 == 0) {
			RTW_PRINT_SEL(sel, "0x%02x ", i);
		}

		_RTW_PRINT_SEL(sel, "%02x ", rtw_sd_f0_read8(adapter, i));

		if (i % 16 == 15) {
			_RTW_PRINT_SEL(sel, "\n");
		} else if (i % 8 == 7) {
			_RTW_PRINT_SEL(sel, "\t");
		}
	}
}

void sdio_local_reg_dump(void *sel, _adapter *adapter)
{
	int i, j = 1;

	for (i = 0x0; i < 0x100; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%02x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, (0x1025 << 16) | i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}
}
#endif /* CONFIG_SDIO_HCI */

void mac_reg_dump(void *sel, _adapter *adapter)
{
	int i, j = 1;

	RTW_PRINT_SEL(sel, "======= MAC REG =======\n");

	for (i = 0x0; i < 0x800; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}

#ifdef CONFIG_RTL8814A
	{
		for (i = 0x1000; i < 0x1650; i += 4) {
			if (j % 4 == 1) {
				RTW_PRINT_SEL(sel, "0x%04x", i);
			}
			_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
			if ((j++) % 4 == 0) {
				_RTW_PRINT_SEL(sel, "\n");
			}
		}
	}
#endif /* CONFIG_RTL8814A */

#if defined(CONFIG_RTL8822B) || defined(CONFIG_RTL8821C) || defined(CONFIG_RTL8822C) || defined(CONFIG_RTL8814B) \
	|| defined(CONFIG_RTL8730A)
	for (i = 0x1000; i < 0x1800; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}
#endif /* CONFIG_RTL8822B  or 8821c*/

#if defined(CONFIG_RTL8192F)
	for (i = 0x1000; i < 0x1100; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}
	for (i = 0x1300; i < 0x1360; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}
#endif

#if defined(CONFIG_RTL8814B)
	for (i = 0x2000; i < 0x2800; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}

	for (i = 0x3000; i < 0x3800; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}
#endif

}

void bb_reg_dump(void *sel, _adapter *adapter)
{
	int i, j = 1;

	RTW_PRINT_SEL(sel, "======= BB REG =======\n");
	for (i = 0x800; i < 0x1000; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}

#if defined(CONFIG_RTL8822B) || defined(CONFIG_RTL8821C) || defined(CONFIG_RTL8822C) || defined(CONFIG_RTL8814B) \
	|| defined(CONFIG_RTL8730A)
	for (i = 0x1800; i < 0x2000; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}
#endif /* CONFIG_RTL8822B */

#if defined(CONFIG_RTL8822C) || defined(CONFIG_RTL8814B) || defined(CONFIG_RTL8730A)
	for (i = 0x2c00; i < 0x2c60; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}

	for (i = 0x2d00; i < 0x2df0; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}

	for (i = 0x4000; i < 0x4060; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}

	for (i = 0x4100; i < 0x4200; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}

#endif /* CONFIG_RTL8822C || CONFIG_RTL8814B || CONFIG_8730A */

#if defined(CONFIG_RTL8814B)
	for (i = 0x5200; i < 0x5400; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}
#endif /* CONFIG_RTL8814B */

#if defined(CONFIG_RTL8730A)
	/* RFK(IQK/DPK) */
	RTW_PRINT_SEL(sel, "RFK(IQK/DPK)\n");
	for (i = 0x1B00; i < 0x1C00; i += 4) {
		if (j % 4 == 1) {
			RTW_PRINT_SEL(sel, "0x%04x", i);
		}
		_RTW_PRINT_SEL(sel, " 0x%08x ", rtw_read32(adapter, i));
		if ((j++) % 4 == 0) {
			_RTW_PRINT_SEL(sel, "\n");
		}
	}

