StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_debug.c
	return 0;
}


ssize_t proc_set_war_offload_mdns_machine_name(struct file *file, const char __user *buffer, size_t count, loff_t *pos, void *data)
{
	struct net_device *dev = data;
	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);
	struct dvobj_priv *dvobj = adapter_to_dvobj(padapter);
	struct pwrctrl_priv *pwrpriv = dvobj_to_pwrctl(dvobj);
	char tmp[MAX_MDNS_MACHINE_NAME_LEN * 3 - 1 + 1];

	if (NULL == buffer) {
		RTW_INFO(FUNC_ADPT_FMT ": input buffer is NULL!\n", FUNC_ADPT_ARG(padapter));
		return -EFAULT;
	}

	if (count < 1) {
		RTW_INFO(FUNC_ADPT_FMT ": input length is 0!\n", FUNC_ADPT_ARG(padapter));
		return -EFAULT;
	}

	if (count > sizeof(tmp)) {
		RTW_INFO(FUNC_ADPT_FMT ": input length, %lu, is large than MAX_MDNS_MACHINE_NAME_LEN(%d)\n", FUNC_ADPT_ARG(padapter), (count + 1) / 3,
			 MAX_MDNS_MACHINE_NAME_LEN);
		rtw_warn_on(1);
		return -EFAULT;
	}

	if (buffer && !copy_from_user(tmp, buffer, count)) {

		if (strncmp(tmp, "clean", 5) == 0) {
			_rtw_memset(pwrpriv->wowlan_war_offload_mdns_mnane, 0, sizeof(pwrpriv->wowlan_war_offload_mdns_mnane));
			pwrpriv->wowlan_war_offload_mdns_mnane_num = 0;
		} else {
			int idx = pwrpriv->wowlan_war_offload_mdns_mnane_num;
			if (idx == MAX_MDNS_MACHINE_NAME_NUM) {
				RTW_INFO(FUNC_ADPT_FMT ": the num of machine name is already %d(MAX_MDNS_MACHINE_NAME_NUM)!\n", FUNC_ADPT_ARG(padapter), MAX_MDNS_MACHINE_NAME_NUM);
				return -EFAULT;
			}
			if (rtw_wow_war_mdns_parser_pattern(tmp, pwrpriv->wowlan_war_offload_mdns_mnane[idx].name,
							    (u32 *) &pwrpriv->wowlan_war_offload_mdns_mnane[idx].name_len, MAX_MDNS_MACHINE_NAME_LEN)) {
				pwrpriv->wowlan_war_offload_mdns_mnane_num++;
			}
		}
	}

	return count;
}


int proc_get_war_offload_mdns_service_info(struct seq_file *m, void *v)
{
	struct net_device *dev = m->private;
	_adapter *adapter = (_adapter *)rtw_netdev_priv(dev);
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapter);
	struct pwrctrl_priv *pwrpriv = dvobj_to_pwrctl(dvobj);
	struct war_mdns_service_info *psinfo = pwrpriv->wowlan_war_offload_mdns_service;
	int i = 0, j = 0;

	if (_TRUE == pwrpriv->wowlan_war_offload_mode) {
		if ((WAR_MDNS_V4_RSP_EN & pwrpriv->wowlan_war_offload_ctrl) ||
		    (WAR_MDNS_V6_RSP_EN & pwrpriv->wowlan_war_offload_ctrl) ||
		    (WAR_MDNS_V4_WAKEUP_EN & pwrpriv->wowlan_war_offload_ctrl) ||
		    (WAR_MDNS_V6_WAKEUP_EN & pwrpriv->wowlan_war_offload_ctrl)) {
			for (i = 0; i < pwrpriv->wowlan_war_offload_mdns_service_info_num; i++) {
				RTW_PRINT_SEL(m, "[%d] service info ===> \n", i + 1);
				RTW_PRINT_SEL(m, "\tservice-transport-domain : %s(%d)- %s(%d)- %s(%d)\n",
					      psinfo[i].service, psinfo[i].service_len,
					      psinfo[i].transport, psinfo[i].transport_len,
					      psinfo[i].domain, psinfo[i].domain_len);
				RTW_PRINT_SEL(m, "\ttarget for srv rsp : %s(%d)\n", psinfo[i].target, psinfo[i].target_len);
				RTW_PRINT_SEL(m, "\tport : %x-%x, ttl : %d \n", psinfo[i].port[0], psinfo[i].port[1], psinfo[i].ttl);
				j = psinfo[i].txt_rsp_idx;
				RTW_PRINT_SEL(m, "\ttype txt rsp. [%d] \n", j);
				rtw_wow_war_mdns_dump_txt(m, "type txt rsp. (Str)",
							  pwrpriv->wowlan_war_offload_mdns_txt_rsp[j].txt, pwrpriv->wowlan_war_offload_mdns_txt_rsp[j].txt_len);

			}
			RTW_PRINT_SEL(m, "\n");
		} else {
			RTW_PRINT_SEL(m, "\nMSND RSP Not enabled\n\n");
		}
	} else {
		RTW_PRINT_SEL(m, "\nOffload Not enabled\n\n");
	}

	return 0;
}

ssize_t proc_set_war_offload_mdns_service_info(struct file *file, const char __user *buffer, size_t count, loff_t *pos, void *data)
{
	struct net_device *dev = data;
	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);
	struct dvobj_priv *dvobj = adapter_to_dvobj(padapter);
	struct pwrctrl_priv *pwrpriv = dvobj_to_pwrctl(dvobj);
	struct war_mdns_service_info *psinfo = pwrpriv->wowlan_war_offload_mdns_service;
	u8 idx = 0, port[2], i = 0;
	char *tmp = NULL;
	char srv[MAX_MDNS_SERVICE_NAME_LEN + 1], trans[MAX_MDNS_TRANS_LEN + 1], domain[MAX_MDNS_DOMAIN_LEN + 1];
	char target[MAX_MDNS_TARGET_LEN + 1];
	u32 ttl, tmp_txt_len = 0, port0 = 0, port1 = 0;
	u16 max_input_size = (MAX_MDNS_SERVICE_NAME_LEN + MAX_MDNS_TRANS_LEN + MAX_MDNS_DOMAIN_LEN + MAX_MDNS_TARGET_LEN + 2);
	int txt_idx;

	if (NULL == buffer) {
		RTW_INFO(FUNC_ADPT_FMT ": input buffer is NULL!\n", FUNC_ADPT_ARG(padapter));
		return -EFAULT;
	}

	if (count < 1) {
		RTW_INFO(FUNC_ADPT_FMT ": input length is 0!\n", FUNC_ADPT_ARG(padapter));
		return -EFAULT;
	}

	if (count > (sizeof(char) * (max_input_size))) {
		RTW_INFO(FUNC_ADPT_FMT ":  input length is too large\n", FUNC_ADPT_ARG(padapter));
		rtw_warn_on(1);
		return -EFAULT;
	}

	tmp = rtw_zvmalloc(sizeof(char) * (max_input_size));
	if (NULL == tmp) {
		RTW_INFO(FUNC_ADPT_FMT ": tmp buffer allocate fail!!\n", FUNC_ADPT_ARG(padapter));
		count = -EFAULT;
		goto exit;
	}

	if (buffer && !copy_from_user(tmp, buffer, count)) {
		int num = sscanf(tmp, "%15s %4s %5s %63s %x %x %u %d", srv, trans, domain, target, &port0, &port1, &ttl, &txt_idx);
		/*  MAX_MDNS_SERVICE_NAME_LEN(15),  MAX_MDNS_TRANS_LEN(4), MAX_MDNS_DOMAIN_LEN(5), MAX_MDNS_TARGET_LEN(63) */
		int idx = pwrpriv->wowlan_war_offload_mdns_service_info_num;
		u16 curent_txt_total_size = 0;
		//u16 sscanf_parameter_length = strlen(srv)+strlen(trans)+strlen(domain)+strlen(target)+2+2+4+1+num;

		if (strncmp(srv, "clean", 5) == 0) {
			_rtw_memset(pwrpriv->wowlan_war_offload_mdns_service, 0, sizeof(pwrpriv->wowlan_war_offload_mdns_service));
			pwrpriv->wowlan_war_offload_mdns_service_info_num = 0;
		}
		/*else if(count != sscanf_parameter_length)
		{
			RTW_INFO(FUNC_ADPT_FMT ": Length of total parameters does not match the input buffer. (%d != %lu)\n",
				FUNC_ADPT_ARG(padapter), sscanf_parameter_length, count);
			RTW_INFO(FUNC_ADPT_FMT ": Please check the content and length of each parameter.\n", FUNC_ADPT_ARG(padapter));
			RTW_INFO(FUNC_ADPT_FMT ": input buffer = (%s)(%lu)!\n\n", FUNC_ADPT_ARG(padapter), tmp, count);
			RTW_INFO(FUNC_ADPT_FMT ": srv = %s (%lu)!\n", FUNC_ADPT_ARG(padapter), srv, strlen(srv));
			RTW_INFO(FUNC_ADPT_FMT ": trans = %s (%lu)!\n", FUNC_ADPT_ARG(padapter), trans, strlen(trans));
			RTW_INFO(FUNC_ADPT_FMT ": domain = %s (%lu)!\n", FUNC_ADPT_ARG(padapter), domain, strlen(domain));
			RTW_INFO(FUNC_ADPT_FMT ": target = %s (%lu)!\n", FUNC_ADPT_ARG(padapter), target, strlen(target));
			RTW_INFO(FUNC_ADPT_FMT ": port = %x-%x, ttl = %d!\n", FUNC_ADPT_ARG(padapter), port0, port1, ttl);
			RTW_INFO(FUNC_ADPT_FMT ": txt idx = %d!\n", FUNC_ADPT_ARG(padapter), txt_idx);
			count = -EFAULT;
			goto exit;
		}*/else {
			port[0] = (u8)port0;
			port[1] = (u8)port1;

			if (txt_idx >= MAX_MDNS_TXT_NUM) {
				RTW_INFO(FUNC_ADPT_FMT ": input txt idx, %d, is out of range (0~%d)!\n", FUNC_ADPT_ARG(padapter), txt_idx, MAX_MDNS_TXT_NUM - 1);
				count = -EFAULT;
				goto exit;
			}

